tasks/04-conf/src/Configuration/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ДополнительныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

tasks/04-conf/src/Configuration/Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ===== РЕГИСТРАЦИЯ ОСНОВНЫХ НАЧИСЛЕНИЙ =====
	// Основные начисления (оклад) регистрируются с периодом действия, 
	// соответствующим фактически отработанным дням в месяце
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого Строка Из ОсновныеНачисления Цикл
		// Копируем данные из строки табличной части в движение
		Движение = Движения.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка); 
		// Ключевые периоды для регистра начислений:
    		// - ПериодРегистрации: начало месяца (для группировки начислений по месяцам)
   		// - ПериодДействия: фактические даты работы (для расчета пропорционально дням)
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания);
	КонецЦикла;
	
	// Фиксируем движения в регистре
	Движения.ОсновныеНачисления.Записать();
	
	//Вызываем функцию из общего модуля для записи расчетов по основным начислениям.
	ЗаписьРасчетов.ЗаписатьОсновныеНачисления(Движения.ОсновныеНачисления, Ссылка);
	
	// ===== РЕГИСТРАЦИЯ ДОПОЛНИТЕЛЬНЫХ НАЧИСЛЕНИЙ =====
	// Дополнительные начисления (премии, надбавки) привязаны к целому месяцу,
	// так как рассчитываются от оклада за полный месяц работы
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		// Для дополнительных начислений:
    		// - ПериодРегистрации: начало месяца (как у основных начислений)
    		// - БазовыйПериод: весь месяц (связь с основным начислением за месяц)
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = ПериодРегистрации;
		Движение.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
	КонецЦикла;
	
	// Фиксируем движения в регистре
	Движения.ДополнительныеНачисления.Записать();
	
	//Вызываем функцию из общего модуля для записи расчетов по дополнительным начислениям.
	ЗаписьРасчетов.ЗаписатьДополнительныеНачисления(Движения.ДополнительныеНачисления, Ссылка);
	
КонецПроцедуры
